In [1]:
# create a data 
# name
# city
# age 4 values
# each columns we will miss one value

dict1={'Name':['Ramesh','Suresh','Mahesh',None],
      'Age':[20,21,None,22],
      'City':[None,'Hyd','Pune','Guntur']}
dict1

{'Name': ['Ramesh', 'Suresh', 'Mahesh', None],
 'Age': [20, 21, None, 22],
 'City': [None, 'Hyd', 'Pune', 'Guntur']}

In [3]:
import pandas as pd
import numpy as np

In [5]:
data=pd.DataFrame(dict1)
data

     Name   Age    City
0  Ramesh  20.0    None
1  Suresh  21.0     Hyd
2  Mahesh   NaN    Pune
3    None  22.0  Guntur

- while creating we provided none
- but by defauit the dataframe adjust the data type

In [7]:
data.to_csv('data1.csv',index=False)

In [9]:
import pandas as pd
import numpy as np
dict2={'Names':['Ramesh','Suresh','Mahesh',np.nan],
'Age':[20,21,np.nan,22],
'City':[np.nan,'Hyd','Pune','Guntur']}
data1=pd.DataFrame(dict2)
data1

    Names   Age    City
0  Ramesh  20.0     NaN
1  Suresh  21.0     Hyd
2  Mahesh   NaN    Pune
3     NaN  22.0  Guntur

**fillna**

In [13]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [15]:
data1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [17]:
data1.fillna(30)

    Names   Age    City
0  Ramesh  20.0      30
1  Suresh  21.0     Hyd
2  Mahesh  30.0    Pune
3      30  22.0  Guntur

In [19]:
data1['Names'].fillna('Manish')

0    Ramesh
1    Suresh
2    Mahesh
3    Manish
Name: Names, dtype: object

- pad
- ffill
- backfill
- bfill
- do not any values,only provide the method='pad'

In [24]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='pad')

    Names   Age    City
0  Ramesh  20.0     NaN
1  Suresh  21.0     Hyd
2  Mahesh  21.0    Pune
3  Mahesh  22.0  Guntur

In [26]:
data1

    Names   Age    City
0  Ramesh  20.0     NaN
1  Suresh  21.0     Hyd
2  Mahesh   NaN    Pune
3     NaN  22.0  Guntur

In [28]:
data1.fillna(method='pad',axis=0)
# axis=0 rows
data1.fillna(method='bfill',axis=0)
data1.fillna(method='ffill',axis=0) # PAD
data1.fillna(method='backfill',axis=0)# Bfill

    Names   Age    City
0  Ramesh  20.0     Hyd
1  Suresh  21.0     Hyd
2  Mahesh  22.0    Pune
3     NaN  22.0  Guntur

In [30]:
data1

    Names   Age    City
0  Ramesh  20.0     NaN
1  Suresh  21.0     Hyd
2  Mahesh   NaN    Pune
3     NaN  22.0  Guntur

In [32]:
data1.fillna(method='pad',axis=1)

    Names     Age    City
0  Ramesh    20.0    20.0
1  Suresh    21.0     Hyd
2  Mahesh  Mahesh    Pune
3     NaN    22.0  Guntur

In [34]:
data1.fillna(method='bfill',axis=1)

    Names   Age    City
0  Ramesh  20.0     NaN
1  Suresh  21.0     Hyd
2  Mahesh  Pune    Pune
3    22.0  22.0  Guntur

**Mean-Median-Mode**

In [37]:
# First choose the column
# if it is Numerical colum then fill with mean or median
# If it is categorical column then fill with mode
data1

    Names   Age    City
0  Ramesh  20.0     NaN
1  Suresh  21.0     Hyd
2  Mahesh   NaN    Pune
3     NaN  22.0  Guntur

In [39]:
mean_age=data['Age'].mean()
data['Age'].fillna(mean_age)

0    20.0
1    21.0
2    21.0
3    22.0
Name: Age, dtype: float64

In [41]:
med_age=data['Age'].median()
data['Age'].fillna(med_age)

0    20.0
1    21.0
2    21.0
3    22.0
Name: Age, dtype: float64

In [43]:
data1['City'].mode()

0    Guntur
1       Hyd
2      Pune
Name: City, dtype: object

In [45]:
import pandas as pd
import numpy as np
dict2={'Names':['Ramesh','Suresh','Mahesh',np.nan],
'Age':[20,21,np.nan,22],
'City':[np.nan,'Hyd','Pune','Pune']}
data2=pd.DataFrame(dict2)
data2

    Names   Age  City
0  Ramesh  20.0   NaN
1  Suresh  21.0   Hyd
2  Mahesh   NaN  Pune
3     NaN  22.0  Pune

In [47]:
mode=data2['City'].mode()
data2['City'].fillna(mode)

0    Pune
1     Hyd
2    Pune
3    Pune
Name: City, dtype: object

In [49]:
mean_age

21.0

In [51]:
med_age

21.0

In [53]:
mode.values[0]
# 100% monday you will ask
# you will try below code then you will ask me sir mode is giving error
mode=data2['City'].mode()
data2['City'].fillna(mode.values[0])
data2['City'].fillna(mode) # It will be fail

0    Pune
1     Hyd
2    Pune
3    Pune
Name: City, dtype: object

In [61]:
med_age=data['Age'].median()
data['Age'].fillna(med_age)

mean=data['Age'].mean()
data['Age'].fillna(med_age)

mode=data['City'].mode()
data['City'].fillna(mode.values[0])

0    Guntur
1       Hyd
2      Pune
3    Guntur
Name: City, dtype: object

- random
- pad
- ffill
- bfill
- backfill
- mean
- medain
- mode

mean === may be outliers the data might be affected missing value analysis before
outliers only either you can fill with median or do not take all data mean we will take only
some sample means

**KNN Imputer**

- KNN means K-neraest neighbours
- we will choose the less distnace samples

In [69]:
# Packagename=sklearn
# classname=imputer
# Methodname=KNNImputer
# Read the method
# save the method
# apply fit transform
from sklearn.impute import KNNImputer
knn=KNNImputer()
knn.fit_transform(data[['Age']])

array([[20.],
       [21.],
       [21.],
       [22.]])